# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit: colorize html in terminal
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit: colorize json in terminal
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'powerlevel10k'

# Apps
cask '1password'
cask 'caffeine' # prevent mac from sleeping
cask 'dbngin' #database manager
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
# cask 'google-chrome'
# cask 'gpg-suite'
cask 'helo' # email tester (like mailtrap)
# cask 'homebrew/cask-drivers/elgato-stream-deck' # for professional vlogging
cask 'imageoptim'
cask 'insomnia' # Postman alternative
cask 'copyclip'
# cask 'phpstorm'
cask 'ray'
cask 'rectangle'
cask 'screenflow' # commercial simultaneous screen, camera and mic recording
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver' # rar decompressor
# cask 'tinkerwell'
# cask 'transmit' # commercial file transfer tool
cask 'tunnelbear' # VPN
# cask 'tuple' # commercial remote pair programming
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497 # commercial markdown editor
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
# mas 'Tweetbot', id: 1384080005 # commercial twitter client
